FemDesign.Bars.Connectivity
connectivity_type
Connectivity / End-condition releases

FemDesign.Bars.Connectivity.Mx
Translation local-x axis.

FemDesign.Bars.Connectivity.My
Translation local-y axis.

FemDesign.Bars.Connectivity.Mz
Translation local-z axis.

FemDesign.Bars.Connectivity.Rx
Rotation around local-x axis.

FemDesign.Bars.Connectivity.Ry
Rotation around local-y axis.

FemDesign.Bars.Connectivity.Rz
Rotation around local-z axis.

FemDesign.Bars.Connectivity.#ctor
Parameterless constructor for serialization.

FemDesign.Bars.Connectivity.#ctor(System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Private constructor for binary-rigid definition.
mx:
my:
mz:
rx:
ry:
rz:

FemDesign.Bars.Connectivity.#ctor(System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Private constructor for semi-rigid definition.
mx:
my:
mz:
rx:
ry:
rz:
mxRelease:
myRelease:
mzRelease:
rxRelease:
ryRelease:
rzRelease:

FemDesign.Bars.Connectivity.Default
Define default (rigid) releases for a bar-element.
Returns:

FemDesign.Bars.Connectivity.Hinged
Define hinged releases for a bar-element.
Remarks: Create

FemDesign.Bars.Connectivity.Rigid
Define rigid releases for a bar-element.
Remarks: Create